export let hanaJson = {
  "data": {
    "Floors": [
      {
        "ID": 1,
        "Name": "F1",
        "High": 20,
        "outline": [
          492,
          274,
          [
            [
              0,
              0,
              0,
              130,
              160,
              130,
              160,
              172,
              223,
              172,
              223,
              130,
              492,
              130,
              492,
              0,
              0,
              0
            ],
            250,
            70
          ]
        ],
        "ImageLayer": [
          "hana1.png"
        ],
        "RoomArea": [
          {
            "ID": "R000",
            "Type": "A001",
            "Name": "강당",
            "Remark": "강당",
            "RoomNumber": "B112",
            "outline": [
              460,
              35,
              [
                [
                  429,
                  0,
                  429,
                  35,
                  492,
                  35,
                  492,
                  0,
                  429,
                  0
                ],
                460,
                18
              ]
            ]
          },
          {
            "ID": "R001",
            "Type": "A001",
            "Name": "회의실",
            "Remark": "회의실",
            "RoomNumber": "B111",
            "outline": [
              419,
              29,
              [
                [
                  409,
                  0,
                  409,
                  29,
                  429,
                  29,
                  429,
                  0,
                  409,
                  0
                ],
                419,
                15
              ]
            ]
          },
          {
            "ID": "R002",
            "Type": "A001",
            "Name": "Hana Fitness Center",
            "Remark": "Hana Fitness Center",
            "RoomNumber": "B110",
            "outline": [
              356,
              35,
              [
                [
                  304,
                  0,
                  304,
                  35,
                  409,
                  35,
                  409,
                  0,
                  304,
                  0
                ],
                356,
                18                
              ]
            ]
          },
          {
            "ID": "R003",
            "Type": "A002",
            "Name": "UNI STORE",
            "Remark": "UNISTORE",
            "RoomNumber": "B109",
            "outline": [
              282,
              56,
              [
                [
                  222,
                  0,
                  222,
                  14,
                  240,
                  14,
                  240,
                  56,
                  325,
                  56,
                  325,
                  35,
                  304,
                  35,
                  304,
                  0,
                  222,
                  0
                ],
                282,
                28
              ]
            ]
          },
          {
            "ID": "R004",
            "Type": "A003",
            "Name": "기술사업화센터",
            "Remark": "기술사업화센터",
            "RoomNumber": "B108",
            "outline": [
              230,
              56,
              [
                [
                  200,
                  0,
                  200,
                  30,
                  221,
                  30,
                  221,
                  56,
                  240,
                  56,
                  240,
                  14,
                  222,
                  14,
                  222,
                  0,
                  200,
                  0
                ],
                230,
                28
              ]
            ]
          },
          {
            "ID": "R005",
            "Type": "A003",
            "Name": "ONE-STOP",
            "Remark": "서비스센터",
            "RoomNumber": "B107",
            "outline": [
              211,
              56,
              [
                [
                  200,
                  30,
                  200,
                  49,
                  201,
                  49,
                  201,
                  56,
                  221,
                  56,
                  221,
                  30,
                  200,
                  30
                ],
                211,
                42
              ]
            ]
          },
          {
            "ID": "R006",
            "Type": "S003",
            "Name": "공용화장실",
            "Remark": "공용화장실",
            "RoomNumber": "",
            "outline": [
              190,
              35,
              [
                [
                  180,
                  0,
                  180,
                  35,
                  200,
                  35,
                  200,
                  0,
                  180,
                  0
                ],
                190,
                20
              ]
            ]
          },
          {
            "ID": "R007",
            "Type": "A001",
            "Name": "보건소/의료공제회",
            "Remark": "보건소/의료공제회",
            "RoomNumber": "B102",
            "outline": [
              164,
              35,
              [
                [
                  116,
                  14,
                  116,
                  34,
                  128,
                  34,
                  128,
                  23,
                  148,
                  23,
                  148,
                  35,
                  180,
                  35,
                  180,
                  0,
                  172,
                  0,
                  172,
                  14
                ],
                164,
                22
              ]
            ]
          },
          {
            "ID": "R007",
            "Type": "A001",
            "Name": "열람실",
            "Remark": "열람실",
            "RoomNumber": "B101",
            "outline": [
              116,
              40,
              [
                [
                  0,
                  0,
                  0,
                  65,
                  34,
                  65,
                  34,
                  47,
                  116,
                  47,
                  116,
                  14,
                  172,
                  14,
                  172,
                  0,
                  0,
                  0
                ],
                63,
                27
              ]
            ]
          },
          {
            "ID": "R009",
            "Type": "S004",
            "Name": "SUNKENPLAZA",
            "Remark": "SUNKENPLAZA",
            "RoomNumber": "",
            "outline": [
              109,
              64,
              [
                [
                  34,
                  47,
                  34,
                  83,
                  109,
                  83,
                  109,
                  47
                ],
                365,
                65
              ]
            ]
          },
          {
            "ID": "R011",
            "Type": "S005",
            "Name": "계단",
            "Remark": "계단",
            "RoomNumber": "",
            "outline": [
              149,
              55,
              [
                [
                  109,
                  47,
                  109,
                  55,
                  160,
                  55,
                  160,
                  47
                ],
                150,
                50
              ]
            ]
          },
          {
            "ID": "R012",
            "Type": "S006",
            "Name": "엘리베이터",
            "Remark": "엘리베이터",
            "RoomNumber": "",
            "outline": [
              149,
              74,
              [
                [
                  109,
                  74,
                  109,
                  84,
                  160,
                  84,
                  160,
                  74
                ],
                150,
                78
              ]
            ]
          },
          {
            "ID": "R013",
            "Type": "A001",
            "Name": "노트북 열람실",
            "Remark": "노트북 열람실",
            "RoomNumber": "B134",
            "outline": [
              116,
              89,
              [
                [
                  0,
                  65,
                  0,
                  130,
                  172,
                  130,
                  172,
                  116,
                  116,
                  116,
                  116,
                  83,
                  34,
                  83,
                  34,
                  65,
                  0,
                  65
                ],
                70,
                100
              ]
            ]
          },
          {
            "ID": "R014",
            "Type": "A001",
            "Name": "Group Study",
            "Remark": "Group Study",
            "RoomNumber": "B133",
            "outline": [
              138,
              96,
              [
                [
                  116,
                  96,
                  116,
                  116,
                  161,
                  116,
                  161,
                  96,
                  116,
                  96
                ],
                138,
                110
              ]
            ]
          },
          {
            "ID": "R015",
            "Type": "A001",
            "Name": "DVD Room",
            "Remark": "DVD Room",
            "RoomNumber": "B131",
            "outline": [
              181,
              106,
              [
                [
                  161,
                  96,
                  161,
                  116,
                  181,
                  116,
                  181,
                  96,
                  161,
                  96
                ],
                170,
                106
              ]
            ]
          },
          {
            "ID": "R016",
            "Type": "A001",
            "Name": "음악연습실",
            "Remark": "음악연습실",
            "RoomNumber": "B130",
            "outline": [
              181,
              123,
              [
                [
                  172,
                  116,
                  172,
                  130,
                  181,
                  130,
                  181,
                  116,
                  172,
                  116
                ],
                176,
                123
              ]
            ]
          },
          {
            "ID": "R017",
            "Type": "A001",
            "Name": "Locker2",
            "Remark": "Locker2",
            "RoomNumber": "B129",
            "outline": [
              182,
              169,
              [
                [
                  160,
                  130,
                  160,
                  172,
                  181,
                  172,
                  181,
                  130,
                  160,
                  130
                ],
                168,
                150
              ]
            ]
          },
          {
            "ID": "R018",
            "Type": "A001",
            "Name": "Locker1",
            "Remark": "Locker1",
            "RoomNumber": "B128",
            "outline": [
              202,
              169,
              [
                [
                  202,
                  130,
                  202,
                  172,
                  223,
                  172,
                  223,
                  130,
                  202,
                  130
                ],
                212,
                150
              ]
            ]
          },
          {
            "ID": "R019",
            "Type": "A002",
            "Name": "SandPresso",
            "Remark": "SandPresso",
            "RoomNumber": "B127",
            "outline": [
              212,
              105,
              [
                [
                  202,
                  105,
                  202,
                  130,
                  229,
                  130,
                  229,
                  121,
                  222,
                  121,
                  222,
                  105,
                  202,
                  105
                ],
                212,
                117
              ]
            ]
          },
          {
            "ID": "R020",
            "Type": "A002",
            "Name": "버거킹",
            "Remark": "버거킹",
            "RoomNumber": "B126",
            "outline": [
              248,
              105,
              [
                [
                  222,
                  105,
                  222,
                  121,
                  229,
                  121,
                  229,
                  130,
                  275,
                  130,
                  275,
                  105,
                  222,
                  105
                ],
                248,
                117
              ]
            ]
          },
          {
            "ID": "R021",
            "Type": "A002",
            "Name": "고대빵",
            "Remark": "고대빵",
            "RoomNumber": "B124",
            "outline": [
              280,
              105,
              [
                [
                  275,
                  105,
                  275,
                  117,
                  285,
                  117,
                  285,
                  105,
                  275,
                  105
                ],
                280,
                110
              ]
            ]
          },
          {
            "ID": "R022",
            "Type": "A002",
            "Name": "Emart24",
            "Remark": "Emart24",
            "RoomNumber": "B123",
            "outline": [
              295,
              105,
              [
                [
                  275,
                  117,
                  275,
                  130,
                  305,
                  130,
                  305,
                  105,
                  285,
                  105,
                  285,
                  117,
                  275,
                  117
                ],
                294,
                115
              ]
            ]
          },
          {
            "ID": "R023",
            "Type": "A002",
            "Name": "하나은행",
            "Remark": "하나은행",
            "RoomNumber": "B112",
            "outline": [
              315,
              105,
              [
                [
                  305,
                  105,
                  305,
                  130,
                  330,
                  130,
                  330,
                  96,
                  325,
                  96,
                  325,
                  105,
                  305,
                  105
                ],
                320,
                117
              ]
            ]
          },
          {
            "ID": "R024",
            "Type": "A001",
            "Name": "Lounge-G",
            "Remark": "Lounge-G",
            "RoomNumber": "B125",
            "outline": [
              263,
              75,
              [
                [
                  222,
                  75,
                  222,
                  96,
                  304,
                  96,
                  304,
                  75,
                  222,
                  75
                ],
                262,
                86
              ]
            ]
          },
          {
            "ID": "R025",
            "Type": "A003",
            "Name": "채용상담실",
            "Remark": "채용상담실",
            "RoomNumber": "",
            "outline": [
              337,
              96,
              [
                [
                  330,
                  96,
                  330,
                  130,
                  346,
                  130,
                  346,
                  96,
                  330,
                  96
                ],
                335,
                112
              ]
            ]
          },
          {
            "ID": "R026",
            "Type": "A001",
            "Name": "강의실",
            "Remark": "강의실",
            "RoomNumber": "B120",
            "outline": [
              356,
              96,
              [
                [
                  346,
                  96,
                  346,
                  130,
                  366,
                  130,
                  366,
                  96,
                  346,
                  96
                ],
                354,
                112
              ]
            ]
          },
          {
            "ID": "R027",
            "Type": "A001",
            "Name": "강의실",
            "Remark": "강의실",
            "RoomNumber": "B119",
            "outline": [
              377,
              96,
              [
                [
                  366,
                  96,
                  366,
                  130,
                  389,
                  130,
                  389,
                  96,
                  366,
                  96
                ],
                377,
                112
              ]
            ]
          },
          {
            "ID": "R028",
            "Type": "S003",
            "Name": "공용화장실",
            "Remark": "화장실",
            "RoomNumber": "",
            "outline": [
              398,
              96,
              [
                [
                  389,
                  96,
                  389,
                  130,
                  408,
                  130,
                  408,
                  96,
                  389,
                  96
                ],
                398,
                112
              ]
            ]
          },
          {
            "ID": "R029",
            "Type": "A001",
            "Name": "전시실",
            "Remark": "전시실",
            "RoomNumber": "B116",
            "outline": [
              429,
              96,
              [
                [
                  408,
                  96,
                  408,
                  130,
                  451,
                  130,
                  451,
                  96,
                  408,
                  96
                ],
                429,
                112
              ]
            ]
          },
          {
            "ID": "R030",
            "Type": "A001",
            "Name": "멀티미디어실",
            "Remark": "멀티미디어실",
            "RoomNumber": "B115",
            "outline": [
              468,
              96,
              [
                [
                  451,
                  96,
                  451,
                  130,
                  485,
                  130,
                  485,
                  96,
                  451,
                  96
                ],
                468,
                112
              ]
            ]
          },
          {
            "ID": "R031",
            "Type": "S006",
            "Name": "엘리베이터",
            "Remark": "엘리베이터",
            "RoomNumber": "",
            "outline": [
              471,
              80,
              [
                [
                  471,
                  76,
                  471,
                  85,
                  492,
                  85,
                  492,
                  76,
                  471,
                  76
                ]
              ]
            ]
          },
          {
            "ID": "R031",
            "Type": "S004",
            "Name": "입구",
            "Remark": "입구",
            "RoomNumber": "",
            "outline": [
              461,
              65,
              [
                [
                  461,
                  55,
                  461,
                  76,
                  492,
                  76,
                  492,
                  55,
                  461,
                  55
                ]
              ]
            ]
          },
          {
            "ID": "R033",
            "Type": "S005",
            "Name": "계단",
            "Remark": "계단",
            "RoomNumber": "",
            "outline": [
              471,
              51,
              [
                [
                  471,
                  48,
                  471,
                  54,
                  492,
                  54,
                  492,
                  48,
                  471,
                  48
                ]
              ]
            ]
          },
          {
            "ID": "R034",
            "Type": "S005",
            "Name": "계단",
            "Remark": "계단",
            "RoomNumber": "",
            "outline": [
              345,
              51,
              [
                [
                  345,
                  89,
                  385,
                  89,
                  385,
                  42,
                  345,
                  42
                ]
              ]
            ]
          }
        ]
      },
      {
        "ID": 1,
        "Name": "F2",
        "High": 20,
        "outline": [
          492,
          274,
          [
            [
              0,
              0,
              0,
              130,
              160,
              130,
              160,
              172,
              223,
              172,
              223,
              130,
              492,
              130,
              492,
              0,
              0,
              0
            ],
            250,
            70
          ]
        ],
        "ImageLayer": [
          "hana1.png"
        ],
        "RoomArea": [
          {
            "ID": "R000",
            "Type": "A001",
            "Name": "강당",
            "Remark": "강당",
            "RoomNumber": "B112",
            "outline": [
              460,
              35,
              [
                [
                  429,
                  0,
                  429,
                  35,
                  492,
                  35,
                  492,
                  0,
                  429,
                  0
                ],
                460,
                18
              ]
            ]
          },
          {
            "ID": "R001",
            "Type": "A001",
            "Name": "회의실",
            "Remark": "회의실",
            "RoomNumber": "B111",
            "outline": [
              419,
              29,
              [
                [
                  409,
                  0,
                  409,
                  29,
                  429,
                  29,
                  429,
                  0,
                  409,
                  0
                ],
                419,
                15
              ]
            ]
          },
          {
            "ID": "R002",
            "Type": "A001",
            "Name": "Hana Fitness Center",
            "Remark": "Hana Fitness Center",
            "RoomNumber": "B110",
            "outline": [
              356,
              35,
              [
                [
                  304,
                  0,
                  304,
                  35,
                  409,
                  35,
                  409,
                  0,
                  304,
                  0
                ],
                356,
                18                
              ]
            ]
          },
          {
            "ID": "R003",
            "Type": "A002",
            "Name": "UNI STORE",
            "Remark": "UNISTORE",
            "RoomNumber": "B109",
            "outline": [
              282,
              56,
              [
                [
                  222,
                  0,
                  222,
                  14,
                  240,
                  14,
                  240,
                  56,
                  325,
                  56,
                  325,
                  35,
                  304,
                  35,
                  304,
                  0,
                  222,
                  0
                ],
                282,
                28
              ]
            ]
          },
          {
            "ID": "R004",
            "Type": "A003",
            "Name": "기술사업화센터",
            "Remark": "기술사업화센터",
            "RoomNumber": "B108",
            "outline": [
              230,
              56,
              [
                [
                  200,
                  0,
                  200,
                  30,
                  221,
                  30,
                  221,
                  56,
                  240,
                  56,
                  240,
                  14,
                  222,
                  14,
                  222,
                  0,
                  200,
                  0
                ],
                230,
                28
              ]
            ]
          },
          {
            "ID": "R005",
            "Type": "A003",
            "Name": "ONE-STOP",
            "Remark": "서비스센터",
            "RoomNumber": "B107",
            "outline": [
              211,
              56,
              [
                [
                  200,
                  30,
                  200,
                  49,
                  201,
                  49,
                  201,
                  56,
                  221,
                  56,
                  221,
                  30,
                  200,
                  30
                ],
                211,
                42
              ]
            ]
          },
          {
            "ID": "R006",
            "Type": "S003",
            "Name": "공용화장실",
            "Remark": "공용화장실",
            "RoomNumber": "",
            "outline": [
              190,
              35,
              [
                [
                  180,
                  0,
                  180,
                  35,
                  200,
                  35,
                  200,
                  0,
                  180,
                  0
                ],
                190,
                20
              ]
            ]
          },
          {
            "ID": "R007",
            "Type": "A001",
            "Name": "보건소/의료공제회",
            "Remark": "보건소/의료공제회",
            "RoomNumber": "B102",
            "outline": [
              164,
              35,
              [
                [
                  116,
                  14,
                  116,
                  34,
                  128,
                  34,
                  128,
                  23,
                  148,
                  23,
                  148,
                  35,
                  180,
                  35,
                  180,
                  0,
                  172,
                  0,
                  172,
                  14
                ],
                164,
                22
              ]
            ]
          },
          {
            "ID": "R007",
            "Type": "A001",
            "Name": "열람실",
            "Remark": "열람실",
            "RoomNumber": "B101",
            "outline": [
              116,
              40,
              [
                [
                  0,
                  0,
                  0,
                  65,
                  34,
                  65,
                  34,
                  47,
                  116,
                  47,
                  116,
                  14,
                  172,
                  14,
                  172,
                  0,
                  0,
                  0
                ],
                63,
                27
              ]
            ]
          },
          {
            "ID": "R009",
            "Type": "S004",
            "Name": "SUNKENPLAZA",
            "Remark": "SUNKENPLAZA",
            "RoomNumber": "",
            "outline": [
              109,
              64,
              [
                [
                  34,
                  47,
                  34,
                  83,
                  109,
                  83,
                  109,
                  47
                ],
                365,
                65
              ]
            ]
          },
          {
            "ID": "R011",
            "Type": "S005",
            "Name": "계단",
            "Remark": "계단",
            "RoomNumber": "",
            "outline": [
              149,
              55,
              [
                [
                  109,
                  47,
                  109,
                  55,
                  160,
                  55,
                  160,
                  47
                ],
                150,
                50
              ]
            ]
          },
          {
            "ID": "R012",
            "Type": "S006",
            "Name": "엘리베이터",
            "Remark": "엘리베이터",
            "RoomNumber": "",
            "outline": [
              149,
              74,
              [
                [
                  109,
                  74,
                  109,
                  84,
                  160,
                  84,
                  160,
                  74
                ],
                150,
                78
              ]
            ]
          },
          {
            "ID": "R013",
            "Type": "A001",
            "Name": "노트북 열람실",
            "Remark": "노트북 열람실",
            "RoomNumber": "B134",
            "outline": [
              116,
              89,
              [
                [
                  0,
                  65,
                  0,
                  130,
                  172,
                  130,
                  172,
                  116,
                  116,
                  116,
                  116,
                  83,
                  34,
                  83,
                  34,
                  65,
                  0,
                  65
                ],
                70,
                100
              ]
            ]
          },
          {
            "ID": "R014",
            "Type": "A001",
            "Name": "Group Study",
            "Remark": "Group Study",
            "RoomNumber": "B133",
            "outline": [
              138,
              96,
              [
                [
                  116,
                  96,
                  116,
                  116,
                  161,
                  116,
                  161,
                  96,
                  116,
                  96
                ],
                138,
                110
              ]
            ]
          },
          {
            "ID": "R015",
            "Type": "A001",
            "Name": "DVD Room",
            "Remark": "DVD Room",
            "RoomNumber": "B131",
            "outline": [
              181,
              106,
              [
                [
                  161,
                  96,
                  161,
                  116,
                  181,
                  116,
                  181,
                  96,
                  161,
                  96
                ],
                170,
                106
              ]
            ]
          },
          {
            "ID": "R016",
            "Type": "A001",
            "Name": "음악연습실",
            "Remark": "음악연습실",
            "RoomNumber": "B130",
            "outline": [
              181,
              123,
              [
                [
                  172,
                  116,
                  172,
                  130,
                  181,
                  130,
                  181,
                  116,
                  172,
                  116
                ],
                176,
                123
              ]
            ]
          },
          {
            "ID": "R017",
            "Type": "A001",
            "Name": "Locker2",
            "Remark": "Locker2",
            "RoomNumber": "B129",
            "outline": [
              182,
              169,
              [
                [
                  160,
                  130,
                  160,
                  172,
                  181,
                  172,
                  181,
                  130,
                  160,
                  130
                ],
                168,
                150
              ]
            ]
          },
          {
            "ID": "R018",
            "Type": "A001",
            "Name": "Locker1",
            "Remark": "Locker1",
            "RoomNumber": "B128",
            "outline": [
              202,
              169,
              [
                [
                  202,
                  130,
                  202,
                  172,
                  223,
                  172,
                  223,
                  130,
                  202,
                  130
                ],
                212,
                150
              ]
            ]
          },
          {
            "ID": "R019",
            "Type": "A002",
            "Name": "SandPresso",
            "Remark": "SandPresso",
            "RoomNumber": "B127",
            "outline": [
              212,
              105,
              [
                [
                  202,
                  105,
                  202,
                  130,
                  229,
                  130,
                  229,
                  121,
                  222,
                  121,
                  222,
                  105,
                  202,
                  105
                ],
                212,
                117
              ]
            ]
          },
          {
            "ID": "R020",
            "Type": "A002",
            "Name": "버거킹",
            "Remark": "버거킹",
            "RoomNumber": "B126",
            "outline": [
              248,
              105,
              [
                [
                  222,
                  105,
                  222,
                  121,
                  229,
                  121,
                  229,
                  130,
                  275,
                  130,
                  275,
                  105,
                  222,
                  105
                ],
                248,
                117
              ]
            ]
          },
          {
            "ID": "R021",
            "Type": "A002",
            "Name": "고대빵",
            "Remark": "고대빵",
            "RoomNumber": "B124",
            "outline": [
              280,
              105,
              [
                [
                  275,
                  105,
                  275,
                  117,
                  285,
                  117,
                  285,
                  105,
                  275,
                  105
                ],
                280,
                110
              ]
            ]
          },
          {
            "ID": "R022",
            "Type": "A002",
            "Name": "Emart24",
            "Remark": "Emart24",
            "RoomNumber": "B123",
            "outline": [
              295,
              105,
              [
                [
                  275,
                  117,
                  275,
                  130,
                  305,
                  130,
                  305,
                  105,
                  285,
                  105,
                  285,
                  117,
                  275,
                  117
                ],
                294,
                115
              ]
            ]
          },
          {
            "ID": "R023",
            "Type": "A002",
            "Name": "하나은행",
            "Remark": "하나은행",
            "RoomNumber": "B112",
            "outline": [
              315,
              105,
              [
                [
                  305,
                  105,
                  305,
                  130,
                  330,
                  130,
                  330,
                  96,
                  325,
                  96,
                  325,
                  105,
                  305,
                  105
                ],
                320,
                117
              ]
            ]
          },
          {
            "ID": "R024",
            "Type": "A001",
            "Name": "Lounge-G",
            "Remark": "Lounge-G",
            "RoomNumber": "B125",
            "outline": [
              263,
              75,
              [
                [
                  222,
                  75,
                  222,
                  96,
                  304,
                  96,
                  304,
                  75,
                  222,
                  75
                ],
                262,
                86
              ]
            ]
          },
          {
            "ID": "R025",
            "Type": "A003",
            "Name": "채용상담실",
            "Remark": "채용상담실",
            "RoomNumber": "",
            "outline": [
              337,
              96,
              [
                [
                  330,
                  96,
                  330,
                  130,
                  346,
                  130,
                  346,
                  96,
                  330,
                  96
                ],
                335,
                112
              ]
            ]
          },
          {
            "ID": "R026",
            "Type": "A001",
            "Name": "강의실",
            "Remark": "강의실",
            "RoomNumber": "B120",
            "outline": [
              356,
              96,
              [
                [
                  346,
                  96,
                  346,
                  130,
                  366,
                  130,
                  366,
                  96,
                  346,
                  96
                ],
                354,
                112
              ]
            ]
          },
          {
            "ID": "R027",
            "Type": "A001",
            "Name": "강의실",
            "Remark": "강의실",
            "RoomNumber": "B119",
            "outline": [
              377,
              96,
              [
                [
                  366,
                  96,
                  366,
                  130,
                  389,
                  130,
                  389,
                  96,
                  366,
                  96
                ],
                377,
                112
              ]
            ]
          },
          {
            "ID": "R028",
            "Type": "S003",
            "Name": "공용화장실",
            "Remark": "화장실",
            "RoomNumber": "",
            "outline": [
              398,
              96,
              [
                [
                  389,
                  96,
                  389,
                  130,
                  408,
                  130,
                  408,
                  96,
                  389,
                  96
                ],
                398,
                112
              ]
            ]
          },
          {
            "ID": "R029",
            "Type": "A001",
            "Name": "전시실",
            "Remark": "전시실",
            "RoomNumber": "B116",
            "outline": [
              429,
              96,
              [
                [
                  408,
                  96,
                  408,
                  130,
                  451,
                  130,
                  451,
                  96,
                  408,
                  96
                ],
                429,
                112
              ]
            ]
          },
          {
            "ID": "R030",
            "Type": "A001",
            "Name": "멀티미디어실",
            "Remark": "멀티미디어실",
            "RoomNumber": "B115",
            "outline": [
              468,
              96,
              [
                [
                  451,
                  96,
                  451,
                  130,
                  485,
                  130,
                  485,
                  96,
                  451,
                  96
                ],
                468,
                112
              ]
            ]
          },
          {
            "ID": "R031",
            "Type": "S006",
            "Name": "엘리베이터",
            "Remark": "엘리베이터",
            "RoomNumber": "",
            "outline": [
              471,
              80,
              [
                [
                  471,
                  76,
                  471,
                  85,
                  492,
                  85,
                  492,
                  76,
                  471,
                  76
                ]
              ]
            ]
          },
          {
            "ID": "R031",
            "Type": "S004",
            "Name": "입구",
            "Remark": "입구",
            "RoomNumber": "",
            "outline": [
              461,
              65,
              [
                [
                  461,
                  55,
                  461,
                  76,
                  492,
                  76,
                  492,
                  55,
                  461,
                  55
                ]
              ]
            ]
          },
          {
            "ID": "R033",
            "Type": "S005",
            "Name": "계단",
            "Remark": "계단",
            "RoomNumber": "",
            "outline": [
              471,
              51,
              [
                [
                  471,
                  48,
                  471,
                  54,
                  492,
                  54,
                  492,
                  48,
                  471,
                  48
                ]
              ]
            ]
          },
          {
            "ID": "R034",
            "Type": "S005",
            "Name": "계단",
            "Remark": "계단",
            "RoomNumber": "",
            "outline": [
              345,
              51,
              [
                [
                  345,
                  89,
                  385,
                  89,
                  385,
                  42,
                  345,
                  42
                ]
              ]
            ]
          }
        ]
      },
      {
        "ID": 1,
        "Name": "F3",
        "High": 20,
        "outline": [
          492,
          274,
          [
            [
              0,
              0,
              0,
              130,
              160,
              130,
              160,
              172,
              223,
              172,
              223,
              130,
              492,
              130,
              492,
              0,
              0,
              0
            ],
            250,
            70
          ]
        ],
        "ImageLayer": [
          "hana1.png"
        ],
        "RoomArea": [
          {
            "ID": "R000",
            "Type": "A001",
            "Name": "강당",
            "Remark": "강당",
            "RoomNumber": "B112",
            "outline": [
              460,
              35,
              [
                [
                  429,
                  0,
                  429,
                  35,
                  492,
                  35,
                  492,
                  0,
                  429,
                  0
                ],
                460,
                18
              ]
            ]
          },
          {
            "ID": "R001",
            "Type": "A001",
            "Name": "회의실",
            "Remark": "회의실",
            "RoomNumber": "B111",
            "outline": [
              419,
              29,
              [
                [
                  409,
                  0,
                  409,
                  29,
                  429,
                  29,
                  429,
                  0,
                  409,
                  0
                ],
                419,
                15
              ]
            ]
          },
          {
            "ID": "R002",
            "Type": "A001",
            "Name": "Hana Fitness Center",
            "Remark": "Hana Fitness Center",
            "RoomNumber": "B110",
            "outline": [
              356,
              35,
              [
                [
                  304,
                  0,
                  304,
                  35,
                  409,
                  35,
                  409,
                  0,
                  304,
                  0
                ],
                356,
                18                
              ]
            ]
          },
          {
            "ID": "R003",
            "Type": "A002",
            "Name": "UNI STORE",
            "Remark": "UNISTORE",
            "RoomNumber": "B109",
            "outline": [
              282,
              56,
              [
                [
                  222,
                  0,
                  222,
                  14,
                  240,
                  14,
                  240,
                  56,
                  325,
                  56,
                  325,
                  35,
                  304,
                  35,
                  304,
                  0,
                  222,
                  0
                ],
                282,
                28
              ]
            ]
          },
          {
            "ID": "R004",
            "Type": "A003",
            "Name": "기술사업화센터",
            "Remark": "기술사업화센터",
            "RoomNumber": "B108",
            "outline": [
              230,
              56,
              [
                [
                  200,
                  0,
                  200,
                  30,
                  221,
                  30,
                  221,
                  56,
                  240,
                  56,
                  240,
                  14,
                  222,
                  14,
                  222,
                  0,
                  200,
                  0
                ],
                230,
                28
              ]
            ]
          },
          {
            "ID": "R005",
            "Type": "A003",
            "Name": "ONE-STOP",
            "Remark": "서비스센터",
            "RoomNumber": "B107",
            "outline": [
              211,
              56,
              [
                [
                  200,
                  30,
                  200,
                  49,
                  201,
                  49,
                  201,
                  56,
                  221,
                  56,
                  221,
                  30,
                  200,
                  30
                ],
                211,
                42
              ]
            ]
          },
          {
            "ID": "R006",
            "Type": "S003",
            "Name": "공용화장실",
            "Remark": "공용화장실",
            "RoomNumber": "",
            "outline": [
              190,
              35,
              [
                [
                  180,
                  0,
                  180,
                  35,
                  200,
                  35,
                  200,
                  0,
                  180,
                  0
                ],
                190,
                20
              ]
            ]
          },
          {
            "ID": "R007",
            "Type": "A001",
            "Name": "보건소/의료공제회",
            "Remark": "보건소/의료공제회",
            "RoomNumber": "B102",
            "outline": [
              164,
              35,
              [
                [
                  116,
                  14,
                  116,
                  34,
                  128,
                  34,
                  128,
                  23,
                  148,
                  23,
                  148,
                  35,
                  180,
                  35,
                  180,
                  0,
                  172,
                  0,
                  172,
                  14
                ],
                164,
                22
              ]
            ]
          },
          {
            "ID": "R007",
            "Type": "A001",
            "Name": "열람실",
            "Remark": "열람실",
            "RoomNumber": "B101",
            "outline": [
              116,
              40,
              [
                [
                  0,
                  0,
                  0,
                  65,
                  34,
                  65,
                  34,
                  47,
                  116,
                  47,
                  116,
                  14,
                  172,
                  14,
                  172,
                  0,
                  0,
                  0
                ],
                63,
                27
              ]
            ]
          },
          {
            "ID": "R009",
            "Type": "S004",
            "Name": "SUNKENPLAZA",
            "Remark": "SUNKENPLAZA",
            "RoomNumber": "",
            "outline": [
              109,
              64,
              [
                [
                  34,
                  47,
                  34,
                  83,
                  109,
                  83,
                  109,
                  47
                ],
                365,
                65
              ]
            ]
          },
          {
            "ID": "R011",
            "Type": "S005",
            "Name": "계단",
            "Remark": "계단",
            "RoomNumber": "",
            "outline": [
              149,
              55,
              [
                [
                  109,
                  47,
                  109,
                  55,
                  160,
                  55,
                  160,
                  47
                ],
                150,
                50
              ]
            ]
          },
          {
            "ID": "R012",
            "Type": "S006",
            "Name": "엘리베이터",
            "Remark": "엘리베이터",
            "RoomNumber": "",
            "outline": [
              149,
              74,
              [
                [
                  109,
                  74,
                  109,
                  84,
                  160,
                  84,
                  160,
                  74
                ],
                150,
                78
              ]
            ]
          },
          {
            "ID": "R013",
            "Type": "A001",
            "Name": "노트북 열람실",
            "Remark": "노트북 열람실",
            "RoomNumber": "B134",
            "outline": [
              116,
              89,
              [
                [
                  0,
                  65,
                  0,
                  130,
                  172,
                  130,
                  172,
                  116,
                  116,
                  116,
                  116,
                  83,
                  34,
                  83,
                  34,
                  65,
                  0,
                  65
                ],
                70,
                100
              ]
            ]
          },
          {
            "ID": "R014",
            "Type": "A001",
            "Name": "Group Study",
            "Remark": "Group Study",
            "RoomNumber": "B133",
            "outline": [
              138,
              96,
              [
                [
                  116,
                  96,
                  116,
                  116,
                  161,
                  116,
                  161,
                  96,
                  116,
                  96
                ],
                138,
                110
              ]
            ]
          },
          {
            "ID": "R015",
            "Type": "A001",
            "Name": "DVD Room",
            "Remark": "DVD Room",
            "RoomNumber": "B131",
            "outline": [
              181,
              106,
              [
                [
                  161,
                  96,
                  161,
                  116,
                  181,
                  116,
                  181,
                  96,
                  161,
                  96
                ],
                170,
                106
              ]
            ]
          },
          {
            "ID": "R016",
            "Type": "A001",
            "Name": "음악연습실",
            "Remark": "음악연습실",
            "RoomNumber": "B130",
            "outline": [
              181,
              123,
              [
                [
                  172,
                  116,
                  172,
                  130,
                  181,
                  130,
                  181,
                  116,
                  172,
                  116
                ],
                176,
                123
              ]
            ]
          },
          {
            "ID": "R017",
            "Type": "A001",
            "Name": "Locker2",
            "Remark": "Locker2",
            "RoomNumber": "B129",
            "outline": [
              182,
              169,
              [
                [
                  160,
                  130,
                  160,
                  172,
                  181,
                  172,
                  181,
                  130,
                  160,
                  130
                ],
                168,
                150
              ]
            ]
          },
          {
            "ID": "R018",
            "Type": "A001",
            "Name": "Locker1",
            "Remark": "Locker1",
            "RoomNumber": "B128",
            "outline": [
              202,
              169,
              [
                [
                  202,
                  130,
                  202,
                  172,
                  223,
                  172,
                  223,
                  130,
                  202,
                  130
                ],
                212,
                150
              ]
            ]
          },
          {
            "ID": "R019",
            "Type": "A002",
            "Name": "SandPresso",
            "Remark": "SandPresso",
            "RoomNumber": "B127",
            "outline": [
              212,
              105,
              [
                [
                  202,
                  105,
                  202,
                  130,
                  229,
                  130,
                  229,
                  121,
                  222,
                  121,
                  222,
                  105,
                  202,
                  105
                ],
                212,
                117
              ]
            ]
          },
          {
            "ID": "R020",
            "Type": "A002",
            "Name": "버거킹",
            "Remark": "버거킹",
            "RoomNumber": "B126",
            "outline": [
              248,
              105,
              [
                [
                  222,
                  105,
                  222,
                  121,
                  229,
                  121,
                  229,
                  130,
                  275,
                  130,
                  275,
                  105,
                  222,
                  105
                ],
                248,
                117
              ]
            ]
          },
          {
            "ID": "R021",
            "Type": "A002",
            "Name": "고대빵",
            "Remark": "고대빵",
            "RoomNumber": "B124",
            "outline": [
              280,
              105,
              [
                [
                  275,
                  105,
                  275,
                  117,
                  285,
                  117,
                  285,
                  105,
                  275,
                  105
                ],
                280,
                110
              ]
            ]
          },
          {
            "ID": "R022",
            "Type": "A002",
            "Name": "Emart24",
            "Remark": "Emart24",
            "RoomNumber": "B123",
            "outline": [
              295,
              105,
              [
                [
                  275,
                  117,
                  275,
                  130,
                  305,
                  130,
                  305,
                  105,
                  285,
                  105,
                  285,
                  117,
                  275,
                  117
                ],
                294,
                115
              ]
            ]
          },
          {
            "ID": "R023",
            "Type": "A002",
            "Name": "하나은행",
            "Remark": "하나은행",
            "RoomNumber": "B112",
            "outline": [
              315,
              105,
              [
                [
                  305,
                  105,
                  305,
                  130,
                  330,
                  130,
                  330,
                  96,
                  325,
                  96,
                  325,
                  105,
                  305,
                  105
                ],
                320,
                117
              ]
            ]
          },
          {
            "ID": "R024",
            "Type": "A001",
            "Name": "Lounge-G",
            "Remark": "Lounge-G",
            "RoomNumber": "B125",
            "outline": [
              263,
              75,
              [
                [
                  222,
                  75,
                  222,
                  96,
                  304,
                  96,
                  304,
                  75,
                  222,
                  75
                ],
                262,
                86
              ]
            ]
          },
          {
            "ID": "R025",
            "Type": "A003",
            "Name": "채용상담실",
            "Remark": "채용상담실",
            "RoomNumber": "",
            "outline": [
              337,
              96,
              [
                [
                  330,
                  96,
                  330,
                  130,
                  346,
                  130,
                  346,
                  96,
                  330,
                  96
                ],
                335,
                112
              ]
            ]
          },
          {
            "ID": "R026",
            "Type": "A001",
            "Name": "강의실",
            "Remark": "강의실",
            "RoomNumber": "B120",
            "outline": [
              356,
              96,
              [
                [
                  346,
                  96,
                  346,
                  130,
                  366,
                  130,
                  366,
                  96,
                  346,
                  96
                ],
                354,
                112
              ]
            ]
          },
          {
            "ID": "R027",
            "Type": "A001",
            "Name": "강의실",
            "Remark": "강의실",
            "RoomNumber": "B119",
            "outline": [
              377,
              96,
              [
                [
                  366,
                  96,
                  366,
                  130,
                  389,
                  130,
                  389,
                  96,
                  366,
                  96
                ],
                377,
                112
              ]
            ]
          },
          {
            "ID": "R028",
            "Type": "S003",
            "Name": "공용화장실",
            "Remark": "화장실",
            "RoomNumber": "",
            "outline": [
              398,
              96,
              [
                [
                  389,
                  96,
                  389,
                  130,
                  408,
                  130,
                  408,
                  96,
                  389,
                  96
                ],
                398,
                112
              ]
            ]
          },
          {
            "ID": "R029",
            "Type": "A001",
            "Name": "전시실",
            "Remark": "전시실",
            "RoomNumber": "B116",
            "outline": [
              429,
              96,
              [
                [
                  408,
                  96,
                  408,
                  130,
                  451,
                  130,
                  451,
                  96,
                  408,
                  96
                ],
                429,
                112
              ]
            ]
          },
          {
            "ID": "R030",
            "Type": "A001",
            "Name": "멀티미디어실",
            "Remark": "멀티미디어실",
            "RoomNumber": "B115",
            "outline": [
              468,
              96,
              [
                [
                  451,
                  96,
                  451,
                  130,
                  485,
                  130,
                  485,
                  96,
                  451,
                  96
                ],
                468,
                112
              ]
            ]
          },
          {
            "ID": "R031",
            "Type": "S006",
            "Name": "엘리베이터",
            "Remark": "엘리베이터",
            "RoomNumber": "",
            "outline": [
              471,
              80,
              [
                [
                  471,
                  76,
                  471,
                  85,
                  492,
                  85,
                  492,
                  76,
                  471,
                  76
                ]
              ]
            ]
          },
          {
            "ID": "R031",
            "Type": "S004",
            "Name": "입구",
            "Remark": "입구",
            "RoomNumber": "",
            "outline": [
              461,
              65,
              [
                [
                  461,
                  55,
                  461,
                  76,
                  492,
                  76,
                  492,
                  55,
                  461,
                  55
                ]
              ]
            ]
          },
          {
            "ID": "R033",
            "Type": "S005",
            "Name": "계단",
            "Remark": "계단",
            "RoomNumber": "",
            "outline": [
              471,
              51,
              [
                [
                  471,
                  48,
                  471,
                  54,
                  492,
                  54,
                  492,
                  48,
                  471,
                  48
                ]
              ]
            ]
          },
          {
            "ID": "R034",
            "Type": "S005",
            "Name": "계단",
            "Remark": "계단",
            "RoomNumber": "",
            "outline": [
              345,
              51,
              [
                [
                  345,
                  89,
                  385,
                  89,
                  385,
                  42,
                  345,
                  42
                ]
              ]
            ]
          }
        ]
      }
    ],
    "building": {
      "ID": "Building",
      "Name": "HanaSquare",
      "Tel": "",
      "Address": "",
      "FloorsId": "1",
      "Version": 1,
      "High": 20,
      "FrontAngle": 0,
      "UnderFloors": "",
      "DefaultFloor": 1,
      "Remark": "ID : P Public, R Room, 좌 하 단 1번 적용 3자리\nOutline : 플로어 중점=>크기, 외 입구 =>크기\n P_Type : S001-남자화장실, S002-여자화장실, S003-공용화장실, S004-입구, S005-계단, S006-엘리베이터, S007-에스칼레이터\nR_Type : A001-공용공간(운동, 보건,강당,회의실, 강의실 등), A002-상가, A003-사무실, A004-휴게공간, A005-관리시설(관리실, 창고 등)\n"
    }
  },
  "remark": {
    "Build": "HanaSuard",
    "date": 20220421
  }
}
